       IDENTIFICATION DIVISION.
       PROGRAM-ID. UMSATZ-RECHNER.
       AUTHOR. Johannes Pielmeier.
       DATE-WRITTEN. 2025-NOV-01.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT BUCHUNGEN
               ASSIGN TO "BUCHUNGEN.DAT"
               ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
           FD BUCHUNGEN.
           01 BUCHUNG-LINE PIC X(80).

       WORKING-STORAGE SECTION.
           01 MITARBEITER-VORNAME  PIC X(10).
           01 MITARBEITER-NACHNAME PIC X(10).
           01 ANZAHL-STUNDEN       PIC 9(3).

           01 FIRMA-STUNDENSATZ PIC 9(3) VALUE 150.
           01 GESAMT-UMSATZ PIC 9(6)V99.

           01 FORMAT-UMSATZ-PRO-MITARBEITER.
               02 PRINT-MITARBEITER-NAME   PIC X(20).
               02 FILLER                   PIC X.
               02 PRINT-ANZAHL-STUNDEN     PIC 9(3).
               02 FILLER                   PIC X.
               02 PRINT-MENGE-UMSATZ       PIC $***,***.99.

           01 EOF-FLAG PIC X VALUE "N".

       PROCEDURE DIVISION.
       BEGIN.
           PERFORM INITIALIZE-PROGRAM.
           PERFORM UNTIL EOF-FLAG = "Y"
               READ BUCHUNGEN
                   AT END MOVE "Y" TO EOF-FLAG
               END-READ

               IF EOF-FLAG NOT = "Y"
                   PERFORM PROCESS-LINE
               END-IF
           END-PERFORM
           PERFORM CLEAN-UP.
           STOP RUN.

       INITIALIZE-PROGRAM.
           OPEN INPUT BUCHUNGEN.

       PROCESS-LINE.
           MOVE BUCHUNG-LINE(1:10)  TO MITARBEITER-VORNAME
           MOVE BUCHUNG-LINE(11:10) TO MITARBEITER-NACHNAME
           MOVE BUCHUNG-LINE(21:3)  TO ANZAHL-STUNDEN

           PERFORM BERECHNE-GESAMTUMSATZ.
           PERFORM PRINT-UMSATZ-PRO-MITARBEITER.

       BERECHNE-GESAMTUMSATZ.
           COMPUTE GESAMT-UMSATZ = ANZAHL-STUNDEN * FIRMA-STUNDENSATZ.

       PRINT-UMSATZ-PRO-MITARBEITER.
           MOVE MITARBEITER-VORNAME  TO PRINT-MITARBEITER-NAME(1:10)
           MOVE MITARBEITER-NACHNAME TO PRINT-MITARBEITER-NAME(11:10)
           MOVE ANZAHL-STUNDEN       TO PRINT-ANZAHL-STUNDEN
           MOVE GESAMT-UMSATZ        TO PRINT-MENGE-UMSATZ
           DISPLAY FORMAT-UMSATZ-PRO-MITARBEITER.

       CLEAN-UP.
           CLOSE BUCHUNGEN.

       END PROGRAM UMSATZ-RECHNER.
